In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### group by : 집계 => sql의 group by와 개념은 동일

In [5]:
gb1 = df.groupby(by='Pclass')
gb1

In [6]:
gb1.sum()

        PassengerId  Survived      Age  SibSp  Parch        Fare
Pclass
1             99705       136  7111.42     90     77  18177.4125
2             82056        87  5168.83     74     70   3801.8417
3            215625       119  8924.92    302    193   6714.6951

In [9]:
gb1.count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [11]:
gb1['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [12]:
gb1[['Age', 'Fare']].mean()

              Age       Fare
Pclass
1       38.233441  84.154687
2       29.877630  20.662183
3       25.140620  13.675550

In [13]:
df.groupby('Pclass').mean()

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        461.597222  0.629630  38.233441  0.416667  0.356481  84.154687
2        445.956522  0.472826  29.877630  0.402174  0.380435  20.662183
3        439.154786  0.242363  25.140620  0.615071  0.393075  13.675550

In [14]:
df.groupby('Pclass')['Age'].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [15]:
df.groupby('Pclass')[['Age']].mean()

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

In [16]:
df.groupby('Pclass')[['Age', 'Fare']].mean()

              Age       Fare
Pclass
1       38.233441  84.154687
2       29.877630  20.662183
3       25.140620  13.675550

#### 2개 이상의 컬럼을 group by

In [17]:
df.groupby(['Pclass', 'Sex'])[['Age', 'Fare']].mean()

                     Age        Fare
Pclass Sex
1      female  34.611765  106.125798
       male    41.281386   67.226127
2      female  28.722973   21.970121
       male    30.740707   19.741782
3      female  21.750000   16.118810
       male    26.507589   12.661633

#### 성별 생존율

In [26]:
df.groupby('Sex')[['Survived']].mean()

        Survived
Sex
female  0.742038
male    0.188908

In [29]:
df[df['Sex'] == 'female'].shape[0]

314

In [33]:
df[(df['Sex'] == 'female') & (df['Survived'] == 1)].shape[0]

233

In [34]:
233/314

0.7420382165605095

In [35]:
df[(df['Sex'] == 'female') & (df['Survived'] == 1)].shape[0] / df[df['Sex'] == 'female'].shape[0]

0.7420382165605095

#### 등급별 생존율

In [36]:
df.groupby('Pclass')[['Survived']].mean()

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

#### 성별 등급별 생존율

In [38]:
df.groupby(['Sex', 'Pclass'])[['Survived']].count()

               Survived
Sex    Pclass
female 1             94
       2             76
       3            144
male   1            122
       2            108
       3            347

### aggregate - 합계

In [45]:
df.groupby('Pclass').aggregate(['max', 'mean', 'sum', 'count', 'median'])

       PassengerId                                  Survived                 \
               max        mean     sum count median      max      mean  sum
Pclass
1              890  461.597222   99705   216  472.0        1  0.629630  136
2              887  445.956522   82056   184  435.5        1  0.472826   87
3              891  439.154786  215625   491  432.0        1  0.242363  119

                     ... Parch                                  Fare  \
       count median  ...   max      mean  sum count median       max
Pclass               ...
1        216    1.0  ...     4  0.356481   77   216    0.0  512.3292
2        184    0.0  ...     3  0.380435   70   184    0.0   73.5000
3        491    0.0  ...     6  0.393075  193   491    0.0   69.5500


             mean         sum count   median
Pclass
1       84.154687  18177.4125   216  60.2875
2       20.662183   3801.8417   184  14.2500
3       13.675550   6714.6951   491   8.0500

[3 rows x 30 columns]

In [46]:
df.groupby('Pclass')['Fare'].aggregate(['max', 'mean', 'sum', 'count', 'median'])

             max       mean         sum  count   median
Pclass
1       512.3292  84.154687  18177.4125    216  60.2875
2        73.5000  20.662183   3801.8417    184  14.2500
3        69.5500  13.675550   6714.6951    491   8.0500

In [47]:
df.groupby('Pclass')['Fare'].agg(['max', 'mean', 'sum', 'count', 'median'])

             max       mean         sum  count   median
Pclass
1       512.3292  84.154687  18177.4125    216  60.2875
2        73.5000  20.662183   3801.8417    184  14.2500
3        69.5500  13.675550   6714.6951    491   8.0500

#### column별 다른 함수 적용

In [50]:
df.groupby('Pclass').agg({'Age':'mean', 'Fare':'max'})

              Age      Fare
Pclass
1       38.233441  512.3292
2       29.877630   73.5000
3       25.140620   69.5500

In [51]:
# 하나의 column에 여러 함수 적용하기
df.groupby('Pclass').agg({'Age':['max', 'min'], 'Fare':['mean', 'median']})

         Age             Fare
         max   min       mean   median
Pclass
1       80.0  0.92  84.154687  60.2875
2       70.0  0.67  20.662183  14.2500
3       74.0  0.42  13.675550   8.0500

#### reset_index : 새로운 index 생성

In [56]:
df_g1 = df.groupby('Pclass').agg({'Age':'mean', 'Fare':'max'})

In [59]:
df_g1.reset_index()

   Pclass        Age      Fare
0       1  38.233441  512.3292
1       2  29.877630   73.5000
2       3  25.140620   69.5500